#контрольная работа
#шабанова арина х-71
#уровень С

#задача 1

def calculate_area():
   # ........
   #Вычисляет площадь прямоугольника (молекулы) по заданым длине и ширине
#    .....
 print("Вычисление площади молекулы NaCl")

#Ввод длины и ширины молекулы в нанометрах
# length= float(input(*Введите длину молекулы в нанометрах))

#Задача 3
import math
def calculate_factorial():
    try:
        х=int(input("Введите атомное число элемента:"))
        if x < 0:
            print("факториал отрицательного числа не определен")
        else:
            factorial =math.factorial(x)
            print(f"факториал (х) равен (факториал)")
    except ValueError:
        print('Неправильный ввод.Введите целое число.')
        #calculate_ factorial)()

#задача 2
#Na = 6.022
